const HISTORY_DATA = [
    {
        "id": 1,
        "content": "孔子生魯昌平鄉陬邑。其先宋人也，曰孔防叔。防叔生伯夏，伯夏生叔梁紇。紇與顏氏女野合而生孔子，禱於尼丘得孔子。魯襄公二十二年而孔子生。生而首上圩頂，故因名曰丘云。字仲尼，姓孔氏。",
        "age": 1,
        "year": -551,
        "links": []
    },
    {
        "id": 2,
        "content": "丘生而叔梁紇死，葬於防山。防山在魯東，由是孔子疑其父墓處，母諱之也。孔子為兒嬉戲，常陳俎豆，設禮容。孔子母死，乃殯五父之衢，蓋其慎也。陬人輓父之母誨孔子父墓，然後往合葬於防焉。",
        "age": 17,
        "year": -535,
        "links": []
    },
    {
        "id": 4,
        "content": "孔子年十七。<s>魯大夫孟釐子病且死，誡其嗣懿子曰：「孔丘，聖人之後，滅於宋。其祖弗父何始有宋而嗣讓厲公。及正考父佐戴、武、宣公，三命茲益恭，故鼎銘云：『一命而僂，再命而傴，三命而俯，循墻而走，亦莫敢余侮。饘於是，粥於是，以餬余口。』其恭如是。吾聞聖人之後，雖不當世，必有達者。今孔丘年少好禮，其達者歟？吾即沒，若必師之。」及釐子卒，懿子與魯人南宮敬叔往學禮焉。</s>是歲，季武子卒，平子代立。",
        "age": 17,
        "year": -535,
        "links": [],
        "note": "《史記》這邊寫錯了。孟僖子是西元前518年死的。孔子17歲的時候，孟懿子和南宮敬叔說不定都還沒出生，且怎麼可能拜師17歲的年輕小夥子學禮？"
    },
    {
        "id": 3,
        "content": "孔子要絰，季氏饗士，孔子與往。陽虎絀曰：「季氏饗士，非敢饗子也。」孔子由是退。",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 5,
        "content": "孔子貧且賤。及長，嘗為季氏史，料量平；嘗為司職吏而畜蕃息。由是為司空。已而去魯，斥乎齊，逐乎宋、衛，困於陳蔡之間，於是反魯。孔子長九尺有六寸，人皆謂之「長人」而異之。魯復善待，由是反魯。",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 7,
        "content": "是時也，晉平公淫，六卿擅權，東伐諸侯；楚靈王兵彊，陵轢中國；齊大而近於魯。魯小弱，附於楚則晉怒；附於晉則楚來伐；不備於齊，齊師侵魯。",
        "age": 25,
        "year": -527,
        "links": []
    },
    {
        "id": 8,
        "content": "魯昭公之二十年，而孔子蓋年三十矣。齊景公與晏嬰來適魯，景公問孔子曰：「昔秦穆公國小處辟，其霸何也？」對曰：「秦，國雖小，其志大；處雖辟，行中正。身舉五羖，爵之大夫，起纍紲之中，與語三日，授之以政。以此取之，雖王可也，其霸小矣。」景公說。",
        "age": 30,
        "year": -522,
        "links": []
    },
    {
        "id": 4,
        "content": "<s>孔子年十七。</s>魯大夫孟釐子病且死，誡其嗣懿子曰：「孔丘，聖人之後，滅於宋。其祖弗父何始有宋而嗣讓厲公。及正考父佐戴、武、宣公，三命茲益恭，故鼎銘云：『一命而僂，再命而傴，三命而俯，循墻而走，亦莫敢余侮。饘於是，粥於是，以餬余口。』其恭如是。吾聞聖人之後，雖不當世，必有達者。今孔丘年少好禮，其達者歟？吾即沒，若必師之。」及釐子卒，懿子與魯人南宮敬叔往學禮焉。<s>是歲，季武子卒，平子代立。</s>",
        "age": 34,
        "year": -518,
        "links": []
    },
    {
        "id": 6,
        "content": "魯南宮敬叔言魯君曰：「請與孔子適周。」魯君與之一乘車，兩馬，一豎子俱，適周問禮，蓋見老子云。辭去，而老子送之曰：「吾聞富貴者送人以財，仁人者送人以言。吾不能富貴，竊仁人之號，送子以言，曰：『聰明深察而近於死者，好議人者也。博辯廣大危其身者，發人之惡者也。為人子者毋以有己，為人臣者毋以有己。』」孔子自周反于魯，弟子稍益進焉。",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 9,
        "content": "孔子年三十五，而季平子與郈昭伯以鬬雞故得罪魯昭公，昭公率師擊平子，平子與孟氏、叔孫氏三家共攻昭公，昭公師敗，奔於齊，齊處昭公乾侯。其後頃之，魯亂。孔子適齊，為高昭子家臣，欲以通乎景公。與齊太師語樂，聞韶音，學之，三月不知肉味，齊人稱之。",
        "age": 35,
        "year": -517,
        "links": [
            {
                "text": "三月不知肉味",
                "ref": "三月不知肉味",
            }
        ]
    },
    {
        "id": 10,
        "content": "景公問政孔子，孔子曰：「君君，臣臣，父父，子子。」景公曰：「善哉！信如君不君，臣不臣，父不父，子不子，雖有粟，吾豈得而食諸！」他日又復問政於孔子，孔子曰：「政在節財。」景公說，將欲以尼谿田封孔子。晏嬰進曰：「夫儒者滑稽而不可軌法；倨傲自順，不可以為下；崇喪遂哀，破產厚葬，不可以為俗；游說乞貸，不可以為國。自大賢之息，周室既衰，禮樂缺有間。今孔子盛容飾，繁登降之禮，趨詳之節，累世不能殫其學，當年不能究其禮。君欲用之以移齊俗，非所以先細民也。」後景公敬見孔子，不問其禮。異日，景公止孔子曰：「奉子以季氏，吾不能。」以季、孟之間待之。齊大夫欲害孔子，孔子聞之。景公曰：「吾老矣，弗能用也。」孔子遂行，反乎魯。",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "君君，臣臣",
                "ref": "君君，臣臣"
            },
            {
                "text": "以季、孟之間待之",
                "ref": "以季、孟之間待之"
            }
        ]
    },
    {
        "id": 11,
        "content": "孔子年四十二，魯昭公卒於乾侯，定公立。",
        "age": 42,
        "year": -510,
        "links": []
    },
    {
        "id": 11.1,
        "content": "定公立五年，夏，季平子卒，桓子嗣立。季桓子穿井得土缶，中若羊，問仲尼云「得狗」。仲尼曰：「以丘所聞，羊也。丘聞之：木石之怪，夔、罔閬；水之怪，龍、罔象；土之怪，墳羊。」",
        "age": 47,
        "year": -505,
        "links": []
    },

    {
        "id": 13,
        "content": "桓子嬖臣曰仲梁懷，與陽虎有隙。陽虎欲逐懷，公山不狃止之。其秋，懷益驕，陽虎執懷。桓子怒，陽虎因囚桓子，與盟而醳之。陽虎由此益輕季氏。季氏亦僭於公室，陪臣執國政，是以魯自大夫以下皆僭離於正道。故孔子不仕，退而脩詩書禮樂，弟子彌眾，至自遠方，莫不受業焉。",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "陽貨欲見孔子",
                "ref": "陽貨欲見孔子"
            }
        ]
    },
    {
        "id": 14,
        "content": "定公八年，公山不狃不得意於季氏，因陽虎為亂，欲廢三桓之適，更立其庶孽陽虎素所善者，遂執季桓子。桓子詐之，得脫。",
        "age": 50,
        "year": -502,
        "links": []
    },
    {
        "id": 14.1,
        "content": "定公九年，陽虎不勝，奔于齊。是時孔子年五十。",
        "age": 50,
        "year": -502,
        "links": []
    },
    {
        "id": 15,
        "content": "公山不狃以費畔季氏，使人召孔子。孔子循道彌久，溫溫無所試，莫能己用，曰：「蓋周文武起豐鎬而王，今費雖小，儻庶幾乎！」欲往。子路不說，止孔子。孔子曰：「夫召我者豈徒哉？如用我，其為東周乎！」然亦卒不行。",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "公山不狃以費畔季氏",
                "ref": "公山弗擾以費畔"
            }
        ]
    },
    {
        "id": 16,
        "content": "其後定公以孔子為中都宰，一年，四方皆則之。由中都宰為司空，由司空為大司寇。",
        "age": 51,
        "year": -501,
        "links": []
    },
    {
        "id": 17,
        "content": "定公十年春，及齊平。夏，齊大夫黎鉏言於景公曰：「魯用孔丘，其勢危齊。」乃使使告魯為好會，會於夾谷。魯定公且以乘車好往。孔子攝相事，曰：「臣聞有文事者必有武備，有武事者必有文備。古者諸侯出疆，必具官以從。請具左右司馬。」定公曰：「諾。」具左右司馬。會齊侯夾谷，為壇位，土階三等，以會遇之禮相見，揖讓而登。獻酬之禮畢，齊有司趨而進曰：「請奏四方之樂。」景公曰：「諾。」於是旍旄羽袚矛戟劍撥鼓噪而至。孔子趨而進，歷階而登，不盡一等，舉袂而言曰：「吾兩君為好會，夷狄之樂何為於此！請命有司！」有司卻之，不去，則左右視晏子與景公。景公心怍，麾而去之。有頃，齊有司趨而進曰：「請奏宮中之樂。」景公曰：「諾。」優倡侏儒為戲而前。孔子趨而進，歷階而登，不盡一等，曰：「匹夫而營惑諸侯者罪當誅！請命有司！」有司加法焉，手足異處。景公懼而動，知義不若，歸而大恐，告其群臣曰：「魯以君子之道輔其君，而子獨以夷狄之道教寡人，使得罪於魯君，為之奈何？」有司進對曰：「君子有過則謝以質，小人有過則謝以文。君若悼之，則謝以質。」於是齊侯乃歸所侵魯之鄆、汶陽、龜陰之田以謝過。",
        "age": 52,
        "year": -500,
        "links": [
        ]
    },
    {
        "id": 18,
        "content": "定公十三年夏，孔子言於定公曰：「臣無藏甲，大夫毋百雉之城。」使仲由為季氏宰，將墮三都。於是叔孫氏先墮郈。季氏將墮費，公山不狃、叔孫輒率費人襲魯。公與三子入于季氏之宮，登武子之臺。費人攻之，弗克，入及公側。孔子命申句須、樂頎下伐之，費人北。國人追之，敗諸姑蔑。二子奔齊，遂墮費。將墮郕，公斂處父謂孟孫曰：「墮郕，齊人必至于北門。且郕，孟氏之保鄣，無郕是無孟氏也。我將弗墮。」十二月，公圍郕，弗克。",
        "age": 55,
        "year": -497,
        "links": []
    },
    {
        "id": 19,
        "content": "定公十四年，孔子年五十六，由大司寇行攝相事，有喜色。門人曰：「聞君子禍至不懼，福至不喜。」孔子曰：「有是言也。不曰『樂其以貴下人』乎？」於是誅魯大夫亂政者少正卯。與聞國政三月，粥羔豚者弗飾賈；男女行者別於塗；塗不拾遺；四方之客至乎邑者不求有司，皆予之以歸。",
        "age": 56,
        "year": -496,
        "links": []
    },
    {
        "id": 20,
        "content": "齊人聞而懼，曰：「孔子為政必霸，霸則吾地近焉，我之為先并矣。盍致地焉？」黎鉏曰：「請先嘗沮之；沮之而不可則致地，庸遲乎！」於是選齊國中女子好者八十人，皆衣文衣而舞康樂，文馬三十駟，遺魯君。陳女樂文馬於魯城南高門外，季桓子微服往觀再三，將受，乃語魯君為周道游，往觀終日，怠於政事。子路曰：「夫子可以行矣。」孔子曰：「魯今且郊，如致膰乎大夫，則吾猶可以止。」桓子卒受齊女樂，三日不聽政；郊，又不致膰俎於大夫。孔子遂行，宿乎屯。而師己送，曰：「夫子則非罪。」孔子曰：「吾歌可夫？」歌曰：「彼婦之口，可以出走；彼婦之謁，可以死敗。蓋優哉游哉，維以卒歲！」師己反，桓子曰：「孔子亦何言？」師己以實告。桓子喟然嘆曰：「夫子罪我以群婢故也夫！」",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "齊侯夾谷會魯",
                "ref": "齊人歸女樂"
            }

        ]
    },
    {
        "id": 21,
        "content": "孔子遂適衛，主於子路妻兄顏濁鄒家。衛靈公問孔子：「居魯得祿幾何？」對曰：「奉粟六萬。」衛人亦致粟六萬。居頃之，或譖孔子於衛靈公。靈公使公孫余假一出一入。孔子恐獲罪焉，居十月，去衛。",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 22,
        "content": "將適陳，過匡，顏刻為僕，以其策指之曰：「昔吾入此，由彼缺也。」匡人聞之，以為魯之陽虎。陽虎嘗暴匡人，匡人於是遂止孔子。孔子狀類陽虎，拘焉五日，顏淵後，子曰：「吾以汝為死矣。」顏淵曰：「子在，回何敢死！」匡人拘孔子益急，弟子懼。孔子曰：「文王既沒，文不在茲乎？天之將喪斯文也，後死者不得與于斯文也。天之未喪斯文也，匡人其如予何！」孔子使從者為甯武子臣於衛，然後得去。",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "匡人其如予何",
                "ref": "匡人其如予何"
            }
        ]
    },
    {
        "id": 23,
        "content": "去即過蒲。月餘，反乎衛，主蘧伯玉家。靈公夫人有南子者，使人謂孔子曰：「四方之君子不辱欲與寡君為兄弟者，必見寡小君。寡小君願見。」孔子辭謝，不得已而見之。夫人在絺帷中。孔子入門，北面稽首。夫人自帷中再拜，環珮玉聲璆然。孔子曰：「吾鄉為弗見，見之禮答焉。」子路不說。孔子矢之曰：「予所不者，天厭之！天厭之！」居衛月餘，靈公與夫人同車，宦者雍渠參乘，出，使孔子為次乘，招搖市過之。孔子曰：「吾未見好德如好色者也。」於是醜之，去衛，過曹。是歲，魯定公卒。",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "天厭之",
                "ref": "天厭之"
            },
            {
                "text": "吾未見好德如好色者也",
                "ref": "吾未見好德如好色者也"
            }
        ]
    },
    {
        "id": 24,
        "content": "孔子去曹適宋，與弟子習禮大樹下。宋司馬桓魋欲殺孔子，拔其樹。孔子去。弟子曰：「可以速矣。」孔子曰：「天生德於予，桓魋其如予何！」",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "桓魋其如予何",
                "ref": "桓魋其如予何"
            }
        ]
    },
    {
        "id": 25,
        "content": "孔子適鄭，與弟子相失，孔子獨立郭東門。鄭人或謂子貢曰：「東門有人，其顙似堯，其項類皋陶，其肩類子產，然自要以下不及禹三寸。纍纍若喪家之狗。」子貢以實告孔子。孔子欣然笑曰：「形狀，末也。而謂似喪家之狗，然哉！然哉！」",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 26,
        "content": "孔子遂至陳，主於司城貞子家。<s>歲餘，吳王夫差伐陳，取三邑而去。趙鞅伐朝歌。楚圍蔡，蔡遷于吳。吳敗越王句踐會稽</s>。",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 27,
        "content": "有隼集于陳廷而死，楛矢貫之，石砮，矢長尺有咫。陳湣公使使問仲尼。仲尼曰：「隼來遠矣，此肅慎之矢也。昔武王克商，通道九夷百蠻，使各以其方賄來貢，使無忘職業。於是肅慎貢楛矢石砮，長尺有咫。先王欲昭其令德，以肅慎矢分大姬，配虞胡公而封諸陳。分同姓以珍玉，展親；分異姓以遠職，使無忘服。故分陳以肅慎矢。」試求之故府，果得之。",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 28,
        "content": "孔子居陳三歲，會晉楚爭彊，更伐陳，及吳侵陳，陳常被寇。孔子曰：「歸與！歸與！吾黨之小子狂簡，進取不忘其初。」於是孔子去陳。",
        "age": null,
        "year": null,
        "links": [
        ],
        "note": "「吾黨之小子狂簡」在《史記》中出現了兩次。這次孔子沒有真的回魯國。"
    },
    {
        "id": 29,
        "content": "過蒲，會公叔氏以蒲畔，蒲人止孔子。弟子有公良孺者，以私車五乘從孔子。其為人長賢，有勇力，謂曰：「吾昔從夫子遇難於匡，今又遇難於此，命也已。吾與夫子再罹難，寧鬬而死。」鬬甚疾。蒲人懼，謂孔子曰：「苟毋適衛，吾出子。」與之盟，出孔子東門。孔子遂適衛。子貢曰：「盟可負耶？」孔子曰：「要盟也，神不聽。」",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 30,
        "content": "衛靈公聞孔子來，喜，郊迎。問曰：「蒲可伐乎？」對曰：「可。」靈公曰：「吾大夫以為不可。今蒲，衛之所以待晉楚也，以衛伐之，無乃不可乎？」孔子曰：「其男子有死之志，婦人有保西河之志。吾所伐者不過四五人。」靈公曰：「善。」然不伐蒲。",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 31,
        "content": "靈公老，怠於政，不用孔子。孔子喟然歎曰：「苟有用我者，朞月而已，三年有成。」孔子行。",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 32,
        "content": "佛肸為中牟宰。趙簡子攻范、中行，伐中牟。佛肸畔，使人召孔子。孔子欲往。子路曰：「由聞諸夫子，『其身親為不善者，君子不入也』。今佛肸親以中牟畔，子欲往，如之何？」孔子曰：「有是言也。不曰堅乎，磨而不磷；不曰白乎，涅而不淄。我豈匏瓜也哉，焉能系而不食？」",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "我豈匏瓜也哉，焉能系而不食",
                "ref": "XVII-7"
            }
        ]
    },
    {
        "id": 33,
        "content": "孔子擊磬。有荷蕢而過門者，曰：「有心哉，擊磬乎！硜硜乎，莫己知也夫而已矣！」",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "硜硜乎，莫己知也",
                "ref": "XIV-42"
            }
        ]
    },
    {
        "id": 34,
        "content": "孔子學鼓琴師襄子，十日不進。師襄子曰：「可以益矣。」孔子曰：「丘已習其曲矣，未得其數也。」有間，曰：「已習其數，可以益矣。」孔子曰：「丘未得其志也。」有間，曰：「已習其志，可以益矣。」孔子曰：「丘未得其為人也。」有間，［曰］有所穆然深思焉，有所怡然高望而遠志焉。曰：「丘得其為人，黯然而黑，幾然而長，眼如望羊，如王四國，非文王其誰能為此也！」師襄子辟席再拜，曰：「師蓋云文王操也。」",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 35,
        "content": "孔子既不得用於衛，將西見趙簡子。至於河而聞竇鳴犢、舜華之死也，臨河而嘆曰：「美哉水，洋洋乎！丘之不濟此，命也夫！」子貢趨而進曰：「敢問何謂也？」孔子曰：「竇鳴犢，舜華，晉國之賢大夫也。趙簡子未得志之時，須此兩人而後從政；及其已得志，殺之乃從政。丘聞之也：刳胎殺夭，則麒麟不至郊；竭澤涸漁，則蛟龍不合陰陽；覆巢毀卵，則鳳皇不翔。何則？君子諱傷其類也。夫鳥獸之於不義也尚知辟之，而況乎丘哉！」乃還息乎陬鄉，作為陬操以哀之。而反乎衛，入主蘧伯玉家。",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 36,
        "content": "他日，靈公問兵陳。孔子曰：「俎豆之事則嘗聞之，軍旅之事未之學也。」明日，與孔子語，見蜚鴈，仰視之，色不在孔子。孔子遂行，復如陳。",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "俎豆之事則嘗聞之，軍旅之事未之學也",
                "ref": "XV-1"
            }
        ]
    },
    {
        "id": 26,
        "content": "<s?孔子遂至陳，主於司城貞子家。</s>歲餘，吳王夫差伐陳，取三邑而去。趙鞅伐朝歌。楚圍蔡，蔡遷于吳。吳敗越王句踐會稽。",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 12,
        "content": "吳伐越，墮會稽，得骨節專車。吳使使問仲尼：「骨何者最大？」仲尼曰：「禹致群神於會稽山，防風氏後至，禹殺而戮之，其節專車，此為大矣。」吳客曰：「誰為神？」仲尼曰：「山川之神足以綱紀天下，其守為神，社稷為公侯，皆屬於王者。」客曰：「防風何守？」仲尼曰：「汪罔氏之君守封、禺之山，為釐姓。在虞、夏、商為汪罔，於周為長翟，今謂之大人。」客曰：「人長幾何？」仲尼曰：「僬僥氏三尺，短之至也。長者不過十之，數之極也。」於是吳客曰：「善哉聖人！」",
        "age": 58,
        "year": -494,
        "links": [],
        "note": "吳軍在會稽挖到巨型骨頭，巨大到要用車來載的骨頭，因而遣使問孔子這是什麼。雖然從現代觀點看來，這很可能是恐龍化石，但孔子卻鬼扯了一個巨人「防風氏」的神話故事，還唬爛一堆細節。最後吳國人聽得津津有味，直誇孔子「好一個聖人呀！」。這則的年代可能是494 BC夫椒之戰後。"
    },
    {
        "id": 37,
        "content": "夏，衛靈公卒，立孫輒，是為衛出公。六月，趙鞅內太子蒯聵于戚。陽虎使太子絻，八人衰絰，偽自衛迎者，哭而入，遂居焉。冬，蔡遷于州來。是歲魯哀公三年，而孔子年六十矣。齊助衛圍戚，以衛太子蒯聵在故也。",
        "age": 60,
        "year": -492,
        "links": []
    },
    {
        "id": 38,
        "content": "夏，魯桓釐廟燔，南宮敬叔救火。孔子在陳，聞之，曰：「災必於桓釐廟乎？」已而果然。",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 39,
        "content": "秋，季桓子病，輦而見魯城，喟然嘆曰：「昔此國幾興矣，以吾獲罪於孔子，故不興也。」顧謂其嗣康子曰：「我即死，若必相魯；相魯，必召仲尼。」後數日，桓子卒，康子代立。已葬，欲召仲尼。公之魚曰：「昔吾先君用之不終，終為諸侯笑。今又用之，不能終，是再為諸侯笑。」康子曰：「則誰召而可？」曰：「必召冉求。」於是使使召冉求。冉求將行，孔子曰：「魯人召求，非小用之，將大用之也。」是日，孔子曰：「歸乎歸乎！吾黨之小子狂簡，斐然成章，吾不知所以裁之。」子貢知孔子思歸，送冉求，因誡曰「即用，以孔子為招」云。",
        "age": 60,
        "year": -492,
        "links": [
            {
                "text": "吾黨之小子狂簡",
                "ref": "吾黨之小子狂簡"
            }
        ]
    },
    {
        "id": 40,
        "content": "冉求既去，明年，孔子自陳遷于蔡。蔡昭公將如吳，吳召之也。前昭公欺其臣遷州來，後將往，大夫懼復遷，公孫翩射殺昭公。楚侵蔡。秋，齊景公卒。",
        "age": 62,
        "year": -490,
        "links": []
    },
    {
        "id": 41,
        "content": "明年，孔子自蔡如葉。葉公問政，孔子曰：「政在來遠附邇。」他日，葉公問孔子於子路，子路不對。孔子聞之，曰：「由，爾何不對曰『其為人也，學道不倦，誨人不厭，發憤忘食，樂以忘憂，不知老之將至』云爾。」",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "發憤忘食，樂以忘憂，不知老之將至",
                "ref": "VII-19"
            }
        ]
    },
    {
        "id": 42,
        "content": "去葉，反于蔡。長沮、桀溺耦而耕，孔子以為隱者，使子路問津焉。長沮曰：「彼執輿者為誰？」子路曰：「為孔丘。」曰：「是魯孔丘與？」曰：「然。」曰：「是知津矣。」桀溺謂子路曰：「子為誰？」曰：「為仲由。」曰：「子，孔丘之徒與？」曰：「然。」桀溺曰：「悠悠者天下皆是也，而誰以易之？且與其從辟人之士，豈若從辟世之士哉！」耰而不輟。子路以告孔子，孔子憮然曰：「鳥獸不可與同群。天下有道，丘不與易也。」",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "鳥獸不可與同群",
                "ref": "XVIII-6"
            }
        ]
    },
    {
        "id": 43,
        "content": "他日，子路行，遇荷蓧丈人，曰：「子見夫子乎？」丈人曰：「四體不勤，五穀不分，孰為夫子！」植其杖而芸。子路以告，孔子曰：「隱者也。」復往，則亡。",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "五穀不分，孰為夫子",
                "ref": "五穀不分，孰為夫子"
            }
        ]
    },
    {
        "id": 44,
        "content": "孔子遷于蔡三歲，吳伐陳。楚救陳，軍于城父。聞孔子在陳蔡之間，楚使人聘孔子。孔子將往拜禮，陳蔡大夫謀曰：「孔子賢者，所刺譏皆中諸侯之疾。今者久留陳蔡之間，諸大夫所設行皆非仲尼之意。今楚，大國也，來聘孔子。孔子用於楚，則陳蔡用事大夫危矣。」於是乃相與發徒役圍孔子於野。不得行，絕糧。從者病，莫能興。孔子講誦弦歌不衰。子路慍見曰：「君子亦有窮乎？」孔子曰：「君子固窮，小人窮斯濫矣。」",
        "age": 63,
        "year": -489,
        "links": [
            {
                "text": "君子亦有窮乎",
                "ref": "君子亦有窮乎"
            }
        ]
    },
    {
        "id": 45,
        "content": "子貢色作。孔子曰：「賜，爾以予為多學而識之者與？」曰：「然。非與？」孔子曰：「非也。予一以貫之。」",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "予一以貫之",
                "ref": "XV-3"
            }
        ]
    },
    {
        "id": 46,
        "content": "孔子知弟子有慍心，乃召子路而問曰：「《詩》云『匪兕匪虎，率彼曠野』。吾道非邪？吾何為於此？」子路曰：「意者吾未仁邪？人之不我信也。意者吾未知邪？人之不我行也。」孔子曰：「有是乎！由，譬使仁者而必信，安有伯夷、叔齊？使知者而必行，安有王子比干？」",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 47,
        "content": "子路出，子貢入見。孔子曰：「賜，《詩》云『匪兕匪虎，率彼曠野』。吾道非邪？吾何為於此？」子貢曰：「夫子之道至大也，故天下莫能容夫子。夫子蓋少貶焉？」孔子曰：「賜，良農能稼而不能為穡，良工能巧而不能為順。君子能脩其道，綱而紀之，統而理之，而不能為容。今爾不脩爾道而求為容。賜，而志不遠矣！」",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 48,
        "content": "子貢出，顏回入見。孔子曰：「回，《詩》云『匪兕匪虎，率彼曠野』。吾道非邪？吾何為於此？」顏回曰：「夫子之道至大，故天下莫能容。雖然，夫子推而行之，不容何病，不容然後見君子！夫道之不修也，是吾醜也。夫道既已大修而不用，是有國者之醜也。不容何病，不容然後見君子！」孔子欣然而笑曰：「有是哉顏氏之子！使爾多財，吾為爾宰。」",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 49,
        "content": "於是使子貢至楚。楚昭王興師迎孔子，然後得免。",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 50,
        "content": "昭王將以書社地七百里封孔子。楚令尹子西曰：「王之使使諸侯有如子貢者乎？」曰：「無有。」「王之輔相有如顏回者乎？」曰：「無有。」「王之將率有如子路者乎？」曰：「無有。」「王之官尹有如宰予者乎？」曰：「無有。」「且楚之祖封於周，號為子男五十里。今孔丘述三五之法，明周召之業，王若用之，則楚安得世世堂堂方數千里乎？夫文王在豐，武王在鎬，百里之君卒王天下。今孔丘得據土壤，賢弟子為佐，非楚之福也。」昭王乃止。其秋，楚昭王卒于城父。",
        "age": null,
        "year": -489,
        "links": []
    },
    {
        "id": 51,
        "content": "楚狂接輿歌而過孔子曰：「鳳兮！鳳兮！何德之衰？往者不可諫兮，來者猶可追也！已而，已而！今之從政者殆而！」孔子下，欲與之言。趨而去，弗得與之言。",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "楚狂接輿",
                "ref": "楚狂接輿"
            }
        ]
    },
    {
        "id": 52,
        "content": "於是孔子自楚反乎衛。是歲也，孔子年六十三，而魯哀公六年也。",
        "age": 63,
        "year": -489,
        "links": []
    },
    {
        "id": 53,
        "content": "其明年，吳與魯會繒，徵百牢。太宰嚭召季康子。康子使子貢往，然後得已。",
        "age": 64,
        "year": -488,
        "note": "隔年，吳國和魯國在繒這個地方會盟。吳國要求魯國提供100套祭品。吳國的太宰嚭叫季康子出來面對，季康子叫子貢去面對。子貢說服了吳國廢除這個無理的要求。",
        "links": []
    },
    {
        "id": 54,
        "content": "孔子曰：「魯衛之政，兄弟也。」是時，衛君輒父不得立，在外，諸侯數以為讓。而孔子弟子多仕於衛，衛君欲得孔子為政。子路曰：「衛君待子而為政，子將奚先？」孔子曰：「必也正名乎！」子路曰：「有是哉，子之迂也！何其正也？」孔子曰：「野哉由也！夫名不正則言不順，言不順則事不成，事不成則禮樂不興，禮樂不興則刑罰不中，刑罰不中則民無所錯手足矣。夫君子為之必可名，言之必可行。君子於其言，無所苟而已矣。」",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "必也正名乎",
                "ref": "必也正名乎"
            }
        ]
    },
    {
        "id": 55,
        "content": "其明年，冉有為季氏將師，與齊戰於郎，克之。季康子曰：「子之於軍旅，學之乎？性之乎？」冉有曰：「學之於孔子。」季康子曰：「孔子何如人哉？」對曰：「用之有名；播之百姓，質諸鬼神而無憾。求之至於此道，雖累千社，夫子不利也。」康子曰：「我欲召之，可乎？」對曰：「欲召之，則毋以小人固之，則可矣。」而衛孔文子將攻太叔，問策於仲尼。仲尼辭不知，退而命載而行，曰：「鳥能擇木，木豈能擇鳥乎！」文子固止。會季康子逐公華、公賓、公林，以幣迎孔子，孔子歸魯。",
        "age": 68,
        "year": -484,
        "links": []
    },
    {
        "id": 56,
        "content": "孔子之去魯凡十四歲而反乎魯。",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 57,
        "content": "魯哀公問政，對曰：「政在選臣。」季康子問政，曰：「舉直錯諸枉，則枉者直。」康子患盜，孔子曰：「苟子之不欲，雖賞之不竊。」然魯終不能用孔子，孔子亦不求仕。",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "舉直錯諸枉",
                "ref": "舉直錯諸枉"
            },
            {
                "text": "康子患盜",
                "ref": "康子患盜"
            }
        ]
    },
    {
        "id": 58,
        "content": "孔子之時，周室微而禮樂廢，詩書缺。追跡三代之禮，序書傳，上紀唐虞之際，下至秦繆，編次其事。曰：「夏禮吾能言之，杞不足徵也。殷禮吾能言之，宋不足徵也。足，則吾能徵之矣。」觀殷夏所損益，曰：「後雖百世可知也，以一文一質。周監二代，郁郁乎文哉。吾從周。」故《書傳》、《禮記》自孔氏。",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 59,
        "content": "孔子語魯大師：「樂其可知也。始作翕如，縱之純如，皦如，繹如也，以成。」「吾自衛反魯，然後樂正，雅頌各得其所。」",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "皦如",
                "ref": "皦如"
            }
        ]
    },
    {
        "id": 60,
        "content": "古者詩三千餘篇，及至孔子，去其重，取可施於禮義，上采契后稷，中述殷周之盛，至幽厲之缺，始於衽席，故曰「關雎之亂以為風始，鹿鳴為小雅始，文王為大雅始，清廟為頌始」。三百五篇孔子皆弦歌之，以求合韶武雅頌之音。禮樂自此可得而述，以備王道，成六藝。",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 61,
        "content": "孔子晚而喜易，序彖、繫、象、說卦、文言。讀易，韋編三絕。曰：「假我數年，若是，我於易則彬彬矣。」",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "加我數年",
                "ref": "加我數年"
            }
        ]
    },
    {
        "id": 62,
        "content": "孔子以詩書禮樂教，弟子蓋三千焉，身通六藝者七十有二人。如顏濁鄒之徒，頗受業者甚眾。",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 63,
        "content": "孔子以四教：文，行，忠，信。絕四：毋意，毋必，毋固，毋我。所慎：齊，戰，疾。子罕言利與命與仁。不憤不啟，舉一隅不以三隅反，則弗復也。",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "子罕言利",
                "ref": "子罕言利"
            },
            {
                "text": "舉一隅不以三隅反",
                "ref": "舉一隅不以三隅反"
            },
            {
                "text": "絕四",
                "ref": "子絕四"
            },
            {
                "text": "所慎",
                "ref": "子之所慎"
            }
        ]
    },
    {
        "id": 64,
        "content": "其於鄉黨，恂恂似不能言者。其於宗廟朝廷，辯辯言，唯謹爾。朝，與上大夫言，誾誾如也；與下大夫言，侃侃如也。",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "誾誾如也",
                "ref": "誾誾如也"
            },
            {
                "text": "恂恂似不能言",
                "ref": "恂恂如也"
            }
        ]
    },
    {
        "id": 65,
        "content": "入公門，鞠躬如也；趨進，翼如也。君召使儐，色勃如也。君命召，不俟駕行矣。",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "色勃如也",
                "ref": "色勃如也"
            }
        ]
    },
    {
        "id": 66,
        "content": "魚餒，肉敗，割不正，不食。席不正，不坐。食於有喪者之側，未嘗飽也。",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "魚餒",
                "ref": "魚餒"
            }
        ]
    },
    {
        "id": 67,
        "content": "是日哭，則不歌。見齊衰、瞽者，雖童子必變。",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "是日哭",
                "ref": "是日哭"
            },
            {
                "text": "瞽者",
                "ref": "瞽者"
            }
        ]
    },
    {
        "id": 68,
        "content": "「三人行，必得我師。」「德之不脩，學之不講，聞義不能徙，不善不能改，是吾憂也。」使人歌，善，則使復之，然後和之。",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "三人行，必得我師",
                "ref": "三人行"
            }
        ]
    },
    {
        "id": 69,
        "content": "子不語：怪，力，亂，神。",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "子不語",
                "ref": "子不語"
            }
        ]
    },
    {
        "id": 70,
        "content": "子貢曰：「夫子之文章，可得聞也。夫子言天道與性命，弗可得聞也已。」顏淵喟然嘆曰：「仰之彌高，鑽之彌堅。瞻之在前，忽焉在後。夫子循循然善誘人，博我以文，約我以禮，欲罷不能。既竭我才，如有所立，卓爾。雖欲從之，蔑由也已。」達巷黨人［童子］曰：「大哉孔子，博學而無所成名。」子聞之曰：「我何執？執御乎？執射乎？我執御矣。」牢曰：「子云『不試，故藝』。」",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "三人行",
                "ref": "三人行"
            },
            {
                "text": "故藝",
                "ref": "故藝"
            }
        ]
    },
    {
        "id": 71,
        "content": "魯哀公十四年春，狩大野。叔孫氏車子鉏商獲獸，以為不祥。仲尼視之，曰：「麟也。」取之。曰：「河不出圖，雒不出書，吾已矣夫！」顏淵死，孔子曰：「天喪予！」及西狩見麟，曰：「吾道窮矣！」喟然嘆曰：「莫知我夫！」子貢曰：「何為莫知子？」子曰：「不怨天，不尤人，下學而上達，知我者其天乎！」",
        "age": 71,
        "year": -481,
        "links": [
            {
                "text": "知我者其天乎",
                "ref": "XIV-35"
            }
        ]
    },
    {
        "id": 72,
        "content": "「不降其志，不辱其身，伯夷、叔齊乎！」謂「柳下惠、少連降志辱身矣」。謂「虞仲、夷逸隱居放言，行中清，廢中權」。「我則異於是，無可無不可。」",
        "age": null,
        "year": null,
        "links": [
            {
                "text": "不降其志",
                "ref": "不降其志"
            }
        ]
    },
    {
        "id": 73,
        "content": "子曰：「弗乎弗乎，君子病沒世而名不稱焉。吾道不行矣，吾何以自見於後世哉？」乃因史記作春秋，上至隱公，下訖哀公十四年，十二公。據魯，親周，故殷，運之三代。約其文辭而指博。故吳楚之君自稱王，而春秋貶之曰「子」；踐土之會實召周天子，而春秋諱之曰「天王狩於河陽」：推此類以繩當世。貶損之義，後有王者舉而開之。春秋之義行，則天下亂臣賊子懼焉。",
        "age": 71,
        "year": -481,
        "links": [
            {
                "text": "沒世而名不稱",
                "ref": "沒世而名不稱"
            }
        ]
    },
    {
        "id": 74,
        "content": "孔子在位聽訟，文辭有可與人共者，弗獨有也。至於為春秋，筆則筆，削則削，子夏之徒不能贊一辭。弟子受春秋，孔子曰：「後世知丘者以春秋，而罪丘者亦以春秋。」",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 75,
        "content": "明歲，子路死於衛。孔子病，子貢請見。孔子方負杖逍遙於門，曰：「賜，汝來何其晚也？」孔子因歎，歌曰：「太山壞乎！梁柱摧乎！哲人萎乎！」因以涕下。謂子貢曰：「天下無道久矣，莫能宗予。夏人殯於東階，周人於西階，殷人兩柱閒。昨暮予夢坐奠兩柱之閒，予始殷人也。」後七日卒。",
        "age": 72,
        "year": -480,
        "links": []
    },
    {
        "id": 76,
        "content": "孔子年七十三，以魯哀公十六年四月己丑卒。",
        "age": 73,
        "year": -479,
        "links": []
    },
    {
        "id": 77,
        "content": "哀公誄之曰：「旻天不弔，不愸遺一老，俾屏余一人以在位，煢煢余在疚。嗚呼哀哉！尼父，毋自律！」子貢曰：「君其不沒於魯乎！夫子之言曰：『禮失則昬，名失則愆。失志為昬，失所為愆。』生不能用，死而誄之，非禮也。稱『余一人』，非名也。」",
        "age": null,
        "year": null,
        "links": [],
        "note": "魯哀公宣讀悼詞說：「上天真不慈悲啊！竟不願為我留下一位元老。害得我孤零零一個人在位。我孤苦無依，憂傷成疾。嗚呼哀哉！仲尼爸爸呀，我失去你這位可以效法的人了！」<br/>子貢說：「我看魯君(哀公)恐怕沒辦法在魯國善終了吧！老師曾說：『禮節喪失就會昏亂，名分錯誤就會產生過失。』失去本心叫作昏亂，稱謂不當即是過失。老師生前，魯君不任用他，現在人都死了，才來宣讀悼詞，根本不合乎禮。魯君稱自己為『余一人』（天子專用稱號），這也不合乎名分啊！」"
    },
    {
        "id": 78,
        "content": "孔子葬魯城北泗上，弟子皆服三年。三年心喪畢，相訣而去，則哭，各復盡哀；或復留。唯子貢廬於冢上，凡六年，然後去。弟子及魯人往從冢而家者百有餘室，因命曰孔里。魯世世相傳以歲時奉祠孔子冢，而諸儒亦講禮鄉飲大射於孔子冢。孔子冢大一頃。故所居堂弟子內，後世因廟藏孔子衣冠琴車書，至于漢二百餘年不絕。高皇帝過魯，以太牢祠焉。諸侯卿相至，常先謁然後從政。",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 79,
        "content": "孔子生鯉，字伯魚。伯魚年五十，先孔子死。",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 80,
        "content": "伯魚生伋，字子思，年六十二。嘗困於宋。子思作中庸。",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 81,
        "content": "子思生白，字子上，年四十七。子上生求，字子家，年四十五。子家生箕，字子京，年四十六。子京生穿，字子高，年五十一。子高生子慎，年五十七，嘗為魏相。",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 82,
        "content": "子慎生鮒，年五十七，為陳王涉博士，死於陳下。",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 83,
        "content": "鮒弟子襄，年五十七。嘗為孝惠皇帝博士，遷為長沙太守。長九尺六寸。",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 84,
        "content": "子襄生忠，年五十七。忠生武，武生延年及安國。安國為今皇帝博士，至臨淮太守，蚤卒。安國生卬，卬生驩。",
        "age": null,
        "year": null,
        "links": []
    },
    {
        "id": 85,
        "content": "太史公曰：《詩》有之：「高山仰止，景行行止。」雖不能至，然心鄉往之。余讀孔氏書，想見其為人。適魯，觀仲尼廟堂車服禮器，諸生以時習禮其家，余祗回留之不能去云。天下君王至於賢人眾矣，當時則榮，沒則已焉。孔子布衣，傳十餘世，學者宗之。自天子王侯，中國言六藝者折中於夫子，可謂至聖矣！",
        "age": null,
        "year": null,
        "links": []
    }
];